cves/2020/CVE-2020-3952.poc

## id: CVE-2020-3952
## name: VMware vCenter Server LDAP Broken Access Control
## author: hack007x
## severity: critical
## cve: CVE-2020-3952
## tags: cve,cve2020,vmware,vcenter,ldap,auth-bypass,passive,kev,vkev
## description: Under certain conditions, vmdir that ships with VMware vCenter Server, as part of an embedded or external Platform Services Controller (PSC), does not correctly implement access controls.
## affects: Apply the latest security patches and updates provided by VMware to address access control issues.
## cvss-score: 9.8
## reference: https://nvd.nist.gov/vuln/detail/CVE-2020-3952
## reference: https://www.vmware.com/security/advisories/VMSA-2020-0006.html
## reference: https://github.com/guardicore/vmware_vcenter_cve_2020_3952
## verification: true

POST /sdk/ HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
Content-Type: text/xml
SOAPAction: "urn:vim25/6.5"

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Header>
      <operationID>00000001-00000001</operationID>
   </soap:Header>
   <soap:Body>
      <RetrieveServiceContent xmlns="urn:internalvim25">
         <_this xsi:type="ManagedObjectReference" type="ServiceInstance">ServiceInstance</_this>
      </RetrieveServiceContent>
   </soap:Body>
</soap:Envelope>

#@ condition: and
#@ matcher: body contains "RetrieveServiceContentResponse" || body contains "urn:vim"
#@ matcher: body contains "text/xml"
#@ matcher: status_code == 200
#@ matcher: version version_lt "6.7.0"
#> extract: name=version, from=body, regex=/<version>([^<]+)<\/version>/, group=1





# @VEIL-STAMP: 66c850e677ad0e6d256e91ae04e9395280e4cee87cf439490dbba06f6b0b0b4f
